app/Controllers/EventController.php

SELECT *
FROM `event`
JOIN `charity` ON `event`.`ev_organiser` = `charity`.`charity_id`
JOIN `status` ON `event`.`ev_status` = `status`.`status_id`
JOIN `totalamount` ON `totalamount`.`event_id` = `event`.`ev_id`
ORDER BY `ev_id` DESC
---
    public function fetchevent()
    {

        $user = new EventModel();
        $user->join('charity', 'event.ev_organiser = charity.charity_id');
        $user->join('status', 'event.ev_status = status.status_id');
        $user->join('totalamount', 'totalamount.event_id = event.ev_id');

        $data['rakib'] = $user->orderBy('ev_id', 'DESC')->findAll();