app/Controllers/Home.php

    public function index()
    {

        $user = new DonerModel();
        $user->select('event_id, SUM(amount) as total_amount');
        $user->groupBy('event_id');
        $data['rak'] = $user->findAll();



        $user = new EventModel();


        $user->join('totalamount', 'event.ev_id = totalamount.event_id', 'left');
        $user->join('charity', 'event.ev_organiser = charity.charity_id');
        $user->join('status', 'event.ev_status = status.status_id');

        $data['event'] = $user->orderBy('ev_id', 'DESC')->where('ev_status', 1)->findAll();

        $user = new CharityModel();
        $user->join('categories', 'charity.Catagories = categories.cat_id');
        $data['rakib'] = $user->orderBy('charity_id', 'DESC')->where('cha_status ', 1)->findAll();
---
SELECT *
FROM `event`
LEFT JOIN `totalamount` ON `event`.`ev_id` = `totalamount`.`event_id`
JOIN `charity` ON `event`.`ev_organiser` = `charity`.`charity_id`
JOIN `status` ON `event`.`ev_status` = `status`.`status_id`
WHERE `ev_status` = 1
ORDER BY `ev_id` DESC
SELECT *
FROM `charity`
JOIN `categories` ON `charity`.`Catagories` = `categories`.`cat_id`
WHERE `cha_status` = 1
ORDER BY `charity_id` DESC